/**
 що таке javascript
 - високорівнева (високий рівень абстракції, робота з памяью автоматична)
 - динамічно дипізована (змінні можуть бути любого типу, тип визначається на етапі виконання)
 - слабо типізована (жс виконує автоматичне првиедення типів)
 - однопоточна (в кожен момент часу виконується тільки 1 інструкція)
 - інтерпретована (скірпти виконуються в браузері чи в іншому середовищі, їх не потрібно компілювати)
 - встраюваєма (жс може бути встроєний в ріхні середовища виконання)
 - мультипарадигменна (імперативний стиль, ооп, функціональне програмування)
 мова програмування
 */